#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_x_eks: Reading...
data.terraform_remote_state.fiap_x_eks: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.fiap_x will be created
  + resource "aws_apigatewayv2_api" "fiap_x" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap_x"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_x_api will be created
  + resource "aws_apigatewayv2_integration" "fiap_x_api" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:913112958085:listener/net/a69b63530069d4121ac2b5ef2697a85d/80718aa6801fecb8/4648869dedf37d9c"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_x_identity will be created
  + resource "aws_apigatewayv2_integration" "fiap_x_identity" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:913112958085:listener/net/a4025c664e4294096accb2fb59b7221d/8f4c2c7c5cd3fb24/ac7a597e68affe52"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_api_create_video will be created
  + resource "aws_apigatewayv2_route" "fiap_x_api_create_video" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /api/v1/me/videos"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_api_download_my_content will be created
  + resource "aws_apigatewayv2_route" "fiap_x_api_download_my_content" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /api/v1/me/videos/{id}/download"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_api_get_my_video will be created
  + resource "aws_apigatewayv2_route" "fiap_x_api_get_my_video" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /api/v1/me/videos/{id}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_api_list_my_videos will be created
  + resource "aws_apigatewayv2_route" "fiap_x_api_list_my_videos" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /api/v1/me/videos"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_identity_sign_in will be created
  + resource "aws_apigatewayv2_route" "fiap_x_identity_sign_in" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity/v1/auth/sign-in"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.fiap_x_identity_sign_up will be created
  + resource "aws_apigatewayv2_route" "fiap_x_identity_sign_up" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity/v1/auth/sign-up"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

  # aws_apigatewayv2_vpc_link.fiap_x_eks will be created
  + resource "aws_apigatewayv2_vpc_link" "fiap_x_eks" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "fiap-burger-eks"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-07af7bb16d55369f2",
          + "subnet-099d8bae611f128ba",
        ]
      + tags_all           = (known after apply)
    }

  # aws_security_group.vpc_link will be created
  + resource "aws_security_group" "vpc_link" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "fiap-burger-k8s-vpc-link"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-04f3efb92f1101b26"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apigateway_execution_arn = (sensitive value)
  + apigateway_id            = (sensitive value)
  + apigateway_url           = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*